In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('titanic.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
#`df.describe()` is a method in pandas library that provides descriptive statistics of a DataFrame. It calculates various statistical measures such as count, mean, standard deviation, minimum, maximum, and quartiles for each column in the DataFrame.
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
df[['Name','Sex',"Ticket","Cabin","Embarked"]]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [8]:
#`type(df.dtypes)` is a Python function that returns the type of the object `df.dtypes`. In this case, it is used to determine the type of the data types of the columns in the DataFrame `df`.
type(df.dtypes)

pandas.core.series.Series

In [9]:
df.dtypes==object

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [10]:
#`df.dtypes[df.dtypes==object].index` is a pandas code snippet that is used to retrieve the index labels of columns in a DataFrame (`df`) that have a data type of `object`.
df.dtypes[df.dtypes==object].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [11]:
df.dtypes[df.dtypes=='int64'].index

Index(['PassengerId', 'Survived', 'Pclass', 'SibSp', 'Parch'], dtype='object')

In [12]:
new=df[df.dtypes[df.dtypes=='int64'].index] 
new['Sex']=df['Sex']
new

C:\Users\dell\AppData\Local\Temp\ipykernel_6112\1952324216.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new['Sex']=df['Sex']

     PassengerId  Survived  Pclass  SibSp  Parch     Sex
0              1         0       3      1      0    male
1              2         1       1      1      0  female
2              3         1       3      0      0  female
3              4         1       1      1      0  female
4              5         0       3      0      0    male
..           ...       ...     ...    ...    ...     ...
886          887         0       2      0      0    male
887          888         1       1      0      0  female
888          889         0       3      1      2  female
889          890         1       1      0      0    male
890          891         0       3      0      0    male

[891 rows x 6 columns]

In [13]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [14]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
df[['Survived','Pclass']][4:11:2]

    Survived  Pclass
4          0       3
6          0       1
8          1       3
10         1       3

In [18]:
df["new_col"]=0

In [19]:
df["new_col"]

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: new_col, Length: 891, dtype: int64

In [20]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [21]:
type(df.dtypes)

pandas.core.series.Series

In [22]:
df.dtypes=='object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
new_col        False
dtype: bool

In [23]:
df[df.dtypes[df.dtypes=='object'].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [24]:
df[df.dtypes[df.dtypes=='object'].index].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [25]:
df[df.dtypes[df.dtypes=='int64'].index]

     PassengerId  Survived  Pclass  SibSp  Parch  new_col
0              1         0       3      1      0        0
1              2         1       1      1      0        0
2              3         1       3      0      0        0
3              4         1       1      1      0        0
4              5         0       3      0      0        0
..           ...       ...     ...    ...    ...      ...
886          887         0       2      0      0        0
887          888         1       1      0      0        0
888          889         0       3      1      2        0
889          890         1       1      0      0        0
890          891         0       3      0      0        0

[891 rows x 6 columns]

In [26]:
df[df.dtypes[df.dtypes=='int64'].index].describe()

       PassengerId    Survived      Pclass       SibSp       Parch  new_col
count   891.000000  891.000000  891.000000  891.000000  891.000000    891.0
mean    446.000000    0.383838    2.308642    0.523008    0.381594      0.0
std     257.353842    0.486592    0.836071    1.102743    0.806057      0.0
min       1.000000    0.000000    1.000000    0.000000    0.000000      0.0
25%     223.500000    0.000000    2.000000    0.000000    0.000000      0.0
50%     446.000000    0.000000    3.000000    0.000000    0.000000      0.0
75%     668.500000    1.000000    3.000000    1.000000    0.000000      0.0
max     891.000000    1.000000    3.000000    8.000000    6.000000      0.0

In [27]:
#`pd.Categorical(df['Pclass'])` is creating a categorical variable from the 'Pclass' column in the DataFrame `df`.
pd.Categorical(df['Pclass'])

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [28]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,0

In [29]:
pd.Categorical(df['Survived'])

[0, 1, 1, 1, 0, ..., 0, 1, 0, 1, 0]
Length: 891
Categories (2, int64): [0, 1]

In [31]:
pd.Categorical(df['Survived']).codes

array([0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1,
       1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0,
       0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1,
       0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0,
       0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0], dtype=int8)

In [32]:
pd.Categorical(df['Cabin'])

[NaN, 'C85', NaN, 'C123', NaN, ..., NaN, 'B42', NaN, 'C148', NaN]
Length: 891
Categories (147, object): ['A10', 'A14', 'A16', 'A19', ..., 'F38', 'F4', 'G6', 'T']

In [33]:
#`pd.Categorical(df['Cabin']).codes` is converting the values in the 'Cabin' column of the DataFrame `df` into categorical codes. It returns an array of integers representing the codes for each unique category in the 'Cabin' column.
pd.Categorical(df['Cabin']).codes

array([ -1,  81,  -1,  55,  -1,  -1, 129,  -1,  -1,  -1, 145,  49,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1, 111,  -1,  13,  -1,  -1,
        -1,  63,  -1,  -1,  -1,  41,  -1,  -1,  -1,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,
       101,  -1,  23,  71,  -1,  -1,  -1,  -1,  -1,  21,  80,  -1,  -1,
        -1, 142,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1, 140,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  63,  -1,  -1,
        -1, 122,  -1,  -1,  -1,  12,  91,  -1,  -1,  -1,  -1,  98,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  52,  -1,  -1,  -1,  -1,  -1,  -1,
        -1,  36,  -1,  -1,  -1,  -1, 116,  98,  -1,  -1,  -1, 138,  -1,
        -1,  -1,  -1,  -1,  -1,  -1, 107,  55,  -1,  45,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  -1, 141,  -1,  -1,  61,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1, 123,  -1,  -1,
        -1,  18,  -1,  -1,  -1,  14,  -1,  -1,  69,  -1,  -1,  -1,  -1,
        -1, 144,  -1,   9,  -1,  -1,  -1,  -1,  -1,  -1,  -1, 141,  28,
        43,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1, 145,  -1,  -1,
        -1,   8,  -1,  -1,  -1,  -1,  -1, 103,  -1,  -1,  93,  -1,  -1,
        -1,  -1,  -1,  87,  -1,  -1,  -1,  -1,  -1,  80,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  78,  -1,
        -1, 102,  -1,  -1, 145,  83,  -1,  -1,  -1,  -1,  40,  -1,  -1,
        -1,  -1, 134,  46,  -1,  -1,  -1,  -1,  57,  89,  -1,  -1,  -1,
        54,  -1, 113,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,   3,  -1,
        -1,  -1,  -1,  -1,  -1,  31,  90,  -1,  -1,  -1,  -1,  62,  51,
        36,  -1,  -1,  -1, 116,  -1,  62,  -1,  74,  -1, 125,  72,  35,
        -1,  -1,  -1,  -1,  -1,  -1,  76, 124,  -1,  -1,  -1,  -1,  -1,
        65,  -1,  90,  -1,  17,  -1,  56,  85,  -1,  -1,  -1,  61, 127,
        -1, 146, 141,  63,  -1,  -1,  -1, 142,  -1,  -1,  -1,  -1,  -1,
        59,  -1,  -1,  -1,  -1, 123,  -1,  -1,  -1,  -1,  -1,  -1,  -1,
        -1,  -1, 104,  -1,  -1,  24, 131,  -1,  -1,  -1,  -1,  -1,  -1,
        79,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,
        47,  -1,  -1, 103, 145,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  78,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,
       115,  71,  -1,  -1,  -1, 128,  47,  -1,  -1,  63,  -1,  -1,  -1,
        -1,  -1,  -1,  10,  -1,  -1,  -1,  50,  -1,  -1,  53,  86,  -1,
        -1, 126,  97,  -1,  -1, 117,  -1, 133,  -1,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  90,  -1,   1,  -1,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  31,  -1,  87,  25,  -1,  -1,  -1,  -1,  64,  -1,
        -1,  -1,  96,  -1,  62,  -1,  -1,  -1,  -1,  -1,  42,  74,  -1,
        -1,  -1,  -1,  -1,  -1, 121,  -1,  -1, 106, 142,  -1,  -1,  -1,
        39,  -1,  -1,  17,  -1,  -1,  -1,  88,  -1,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  26,  -1,  -1,  27,  20,  -1,  -1,  -1,  82,  -1,
        -1,  -1,  -1,  -1,  77,  -1,  -1,  -1,  -1,  -1,   2,  -1, 134,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  48,
       121,  -1,  -1,  -1,  -1, 128,  -1,  -1,  -1,  75,  -1,   0,  -1,
       135,  -1,  29,  -1,  -1,  -1,  96,  -1,  -1,  -1,  -1,  -1,  -1,
        -1,   4,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  57,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1, 144,  -1,  -1,  95,  -1,  -1,
        -1, 110,  -1, 114,  -1,  -1,   5,  -1,  33,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  24,  -1,  -1,  -1, 101,  -1,   7,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1, 108,  -1,  -1, 132,
        -1,  -1,  -1,  -1,  -1,  -1,  58,  -1,  38,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  34,  -1, 109,  -1,  -1,  -1,  -1,  -1,  -1,  -1,
        32,  19,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  75, 139,  73, 120,
        -1,  -1,  -1,  -1,  -1, 120,  -1,  -1,  84,  56,  58,  -1,  -1,
       140,  66, 116,  -1,  -1,  -1,  -1,  -1,  -1, 137,  -1,  -1,  -1,
        -1,  -1,  32,  -1,  -1,  -1,  -1,  -1,  -1,  15,  -1,  -1, 105,
        67,  35,  -1,  -1,  20,  -1,  -1, 100,  -1,  -1, 118,  -1,  -1,
        -1,  -1,  -1,  -1,  -1,  40,  -1,  -1,  -1,  47,  -1,  92,  -1,
        -1,  -1,  -1,  -1,  -1, 136,  -1,  -1,  -1, 143,  -1,  -1,  22,
        -1,  19, 112,  -1,  -1,  -1,  -1,  -1,  -1,  44,  -1,  -1,  -1,
        -1,  -1,  -1,  94,  -1,  -1,  -1,  -1,  -1,  47,  -1,  -1,  -1,
        11,  -1,  -1, 137,  -1,  -1,  -1,  -1,  -1,  16,  -1,  -1,  -1,
        -1,  37,  -1,  -1, 118,  -1,  -1,  -1,  -1,  -1,  21,  -1,  -1,
        -1,  -1,  -1, 130,  -1,  -1,  -1,  68,  -1,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  -1,  86,  -1,  -1,  -1,  99,  -1,  -1,  -1, 119,
        -1,  -1,  -1,  -1,  94,  -1,  -1,  -1,  -1,   6,  -1,  -1,  -1,
       102,  34,  -1,  -1,  -1,  -1,  -1,  -1,  70,  -1,  -1,  -1,  -1,
        -1,  -1,  -1,  30,  -1,  60,  -1], dtype=int16)

In [40]:
df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [60]:
df[(df["Age"]<20) & (df["Sex"]=="female")& (df["Survived"]==0)].count()

PassengerId    22
Survived       22
Pclass         22
Name           22
Sex            22
Age            22
SibSp          22
Parch          22
Ticket         22
Fare           22
Cabin           2
Embarked       22
new_col        22
dtype: int64